cask_args appdir: '/Applications'

# shell
brew 'zsh'

# editor
brew 'neovim'

# infra
brew 'awscli'
brew 'kayac/tap/ecspresso'

# env
brew 'direnv'
brew 'rbenv'
brew 'tfenv'
brew 'pyenv'

# node
brew 'volta'
brew 'yarn'

# git
brew 'wget'
brew 'tig'
brew 'ghq'

# search
brew 'fzf'
brew 'peco'
brew 'tree'

# alternative commands
brew 'bat'       # cat
brew 'fd'        # find
brew 'eza'       # ls
brew 'bandwhich' # lsof
brew 'zoxide'    # cd
brew 'ripgrep'   # grep

# parser
brew 'jq'

# process
brew 'procs'

# font
cask 'font-hack-nerd-font'

# terminal
brew 'starship'
cask 'alacritty'
brew 'zellij'

# zsh
brew 'zsh-completions'
brew 'zsh-autosuggestions'
