# shell
brew "zsh"

# editor
brew "neovim"

# infra
brew "awscli"
brew "kayac/tap/ecspresso"

# env
brew "direnv"
brew "rbenv"
brew "tfenv"

# node
brew "asdf"

brew "yarn"

# git
brew "wget"
brew "tig"
brew "ghq"

# search
brew "fzf"
brew "peco"
brew "tree"

# alternative commands
brew "bat"       # cat
brew "fd"        # find
brew "eza"       # ls
brew "bandwhich" # lsof
brew "zoxide"    # cd

# parser
brew "jq"
